
## Plan Result (demo)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.test-secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.test-secret will be created
  + resource "azurerm_key_vault_secret" "test-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/toffee-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/toffeesi-demo"
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":429,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->